<!-- K线图 -->
<template>
  <KLineChart :title="title" :chart-data="chartData" :x-axis="xAxis"></KLineChart>
</template>

<script>
import KLineChart from '@/components/ECharts/KLineChart';
export default {
  components: { KLineChart },
  data() {
    return {
      title: '小在的股票K线图',
      xAxis: {
        type: 'category',
        data: [
          '2022/1/24',
          '2022/1/25',
          '2022/1/28',
          '2022/1/29',
          '2022/1/30',
          '2022/1/31',
          '2022/2/1',
          '2022/2/4',
          '2022/2/5',
          '2022/2/6',
          '2022/2/7',
          '2022/2/8',
          '2022/2/18',
          '2022/2/19',
          '2022/2/20',
          '2022/2/21',
          '2022/2/22',
          '2022/2/25',
          '2022/2/26',
          '2022/2/27',
        ],
      },
      chartData: [
        {
          name: '日K',
          data: [
            [2320.26, 2320.26, 2287.3, 2362.94],
            [2300, 2291.3, 2288.26, 2308.38],
            [2295.35, 2346.5, 2295.35, 2346.92],
            [2347.22, 2358.98, 2337.35, 2363.8],
            [2360.75, 2382.48, 2347.89, 2383.76],
            [2383.43, 2385.42, 2371.23, 2391.82],
            [2377.41, 2419.02, 2369.57, 2421.15],
            [2425.92, 2428.15, 2417.58, 2440.38],
            [2411, 2433.13, 2403.3, 2437.42],
            [2432.68, 2434.48, 2427.7, 2441.73],
            [2430.69, 2418.53, 2394.22, 2433.89],
            [2416.62, 2432.4, 2414.4, 2443.03],
            [2441.91, 2421.56, 2415.43, 2444.8],
            [2420.26, 2382.91, 2373.53, 2427.07],
            [2383.49, 2397.18, 2370.61, 2397.94],
            [2378.82, 2325.95, 2309.17, 2378.82],
            [2322.94, 2314.16, 2308.76, 2330.88],
            [2320.62, 2325.82, 2315.01, 2338.78],
            [2313.74, 2293.34, 2289.89, 2340.71],
            [2297.77, 2313.22, 2292.03, 2324.63],
          ],
        },
      ],
    };
  },
  computed: {},
  // 生命周期 - 创建完成（可以访问当前this实例）
  created() {},
  // 生命周期 - 挂载完成（可以访问DOM元素）
  mounted() {},
  beforeCreate() {}, // 生命周期 - 创建之前
  beforeMount() {}, // 生命周期 - 挂载之前
  beforeUpdate() {}, // 生命周期 - 更新之前
  updated() {}, // 生命周期 - 更新之后
  beforeDestroy() {}, // 生命周期 - 销毁之前
  destroyed() {}, // 生命周期 - 销毁完成
  activated() {}, // 如果页面有keep-alive缓存功能，这个函数会触发
  methods: {},
};
</script>
<style lang="less" scoped>
.container {
}
</style>
